In [32]:
import pandas as pd
import numpy as np

In [33]:
np.random.seed(1)
n = 1000

dates = pd.date_range(start='2050-01-01', periods=n, freq='D')
products = np.random.choice(['Tablet', 'Camera', 'Phone'], n)
prices = np.round(np.random.uniform(50.0, 200.0, n), 2)
quantities = np.random.randint(1, 15, n)

data = {
    'Date': dates,
    'Product': products,
    'Price': prices,
    'Quantities': quantities,
}

df = pd.DataFrame(data)
df

          Date Product   Price  Quantities
0   2050-01-01  Camera  129.19           4
1   2050-01-02  Tablet  161.01          13
2   2050-01-03  Tablet   72.49           2
3   2050-01-04  Camera  132.66           2
4   2050-01-05  Camera   82.49           7
..         ...     ...     ...         ...
995 2052-09-22  Camera   59.99           9
996 2052-09-23   Phone  157.09          10
997 2052-09-24  Camera   99.52          14
998 2052-09-25  Tablet  143.82          13
999 2052-09-26  Camera   88.72          11

[1000 rows x 4 columns]

In [34]:
df.dtypes

Date          datetime64[ns]
Product               object
Price                float64
Quantities             int32
dtype: object

In [27]:
df.to_csv

<bound method NDFrame.to_csv of           Date Product   Price  Quantities
0   2050-01-01  Camera  129.19           4
1   2050-01-02  Tablet  161.01          13
2   2050-01-03  Tablet   72.49           2
3   2050-01-04  Camera  132.66           2
4   2050-01-05  Camera   82.49           7
..         ...     ...     ...         ...
995 2052-09-22  Camera   59.99           9
996 2052-09-23   Phone  157.09          10
997 2052-09-24  Camera   99.52          14
998 2052-09-25  Tablet  143.82          13
999 2052-09-26  Camera   88.72          11

[1000 rows x 4 columns]>

In [30]:
df.to_csv('random_sales.csv', index=True)

In [39]:
df = pd.read_csv('random_sales.csv', parse_dates=['Date'], date_format='%Y-%m-%d')
df.head()

   Unnamed: 0       Date Product   Price  Quantities
0           0 2050-01-01  Camera  129.19           4
1           1 2050-01-02  Tablet  161.01          13
2           2 2050-01-03  Tablet   72.49           2
3           3 2050-01-04  Camera  132.66           2
4           4 2050-01-05  Camera   82.49           7

In [38]:
df.dtypes

Unnamed: 0      int64
Date           object
Product        object
Price         float64
Quantities      int64
dtype: object